a= input("Введите пароль:")
b= input("Повторите пароль:")
if a == b:
    print("Пароль принят")
else:
    print("Пароль не принят")


x = int(input("Место:"))
if x % 2 == 0 and x < 37:
    print("Верхнее плацкарт")
elif x % 2 != 0 and x < 37:
    print("Нижнее плацкарт")
elif x >=37 and x % 2 == 0 and x < 54:
    print("боковое верхнее")
elif x >=37 and x % 2 != 0 and x < 54:
    print("боковое нижнее")
else:
    print("следующий вагон")


def x(year):
    if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
        print(f"Год {year}- високосный")
    else:
        print("Это невисокосный год")
x (int(input("Введите год:")))


a=(input("Введите цвет:"))
b=(input("Введите цвет:"))
if (a == "Красный" or a =="красный" or a == "Желтый" or a =="желтый" or a =="Синий" or a == "синий") and (b == "Красный" or b =="красный" or b == "Желтый" or b =="желтый" or b =="Синий" or b == "синий"):
    if (a =="Красный" and b =="Синий") or (a =="красный" and b =="синий") or (a =="Синий" and b =="Красный") or (a =="синий" and b =="красный") or (a =="синий" and b =="Красный") or (a =="Синий" and b =="красный") or (a =="Красный" and b =="синий") or (a =="красный" and b =="Синий") :
        print("Фиолетовый")
    if (a == "Красный" and b == "Желтый") or (a == "красный" and b == "желтый") or (a =="Желтый" and b =="Красный") or (a =="желтый" and b =="красный") or (a == "Красный" and b == "желтый") or (a == "красный" and b == "Желтый") or (a =="Желтый" and b =="красный") or (a =="желтый" and b =="Красный") :
            print("Оранжевый")
    if (a =="Желтый" and b =="Синий") or (a =="желтый" and b =="синий") or (a =="Синий" and b =="Желтый") or (a =="синий" and b =="желтый") or (a =="Желтый" and b =="синий") or (a =="желтый" and b =="Синий") or (a =="Синий" and b =="желтый") or (a =="синий" and b =="Желтый") :
        print("Зеленый")
else:
    print("Ошибка")
